# CannotAssignSecondaryDistSysToCircuit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..CannotAssignSecondaryDistSysToCircuit Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot assign or add [Element] to Circuit. There is no assigned secondary distribution system for [Element].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAssignSecondaryDistSysToCircuit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAssignSecondaryDistSysToCircuit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAssignSecondaryDistSysToCircuit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace